Repository: InvisibleReMedia/EasyHTMLForDevelopers
Catalog: Localization/Strings.*.resx
Languages: fr

# AddObjectHelp
source: To insert an object, select a master object or a tool
fr: Pour insérer un objet dans une master page, un master objet ou une page il suffit de renseigner le nom du master objet ou bien celui de l'outil

# BackColor
source: Background color
fr: Couleur de fond

source: Border
fr: Bordure

source: Border color
fr: Couleur du bord

source: Browse...
fr: Parcourir...

# ButtonAdd
source: Add
fr: Ajouter

# ButtonCancel
source: Cancel
fr: Annuler

# ButtonClose
source: Close
fr: Fermer

# ButtonCreate
source: Create
fr: Créer

# ButtonNew
source: New
fr: Nouveau

# ButtonNext
source: Next
fr: Suivant

# ButtonOpen
source: Open
fr: Ouvrir

# ButtonRefresh
source: Refresh
fr: Actualiser

# ButtonValidate
source: Confirm
fr: Confirmer

# ColorScheme
source: Colors scheme
fr: Schéma de couleurs

# ConfigView
source: Configuration keys
fr: Configuration de mots-clés

source: Container name
fr: Nom du conteneur

# CreateColor
source: Create a new color
fr: Créer une nouvelle couleur

# CSSOptions
source: Cascading style-sheet options
fr: Options de CSS

# FolderComment
source: It's possible to give a path, each folder is separated by a / char
fr: Il est possible de donner un chemin, chaque dossier étant séparé par le caractère /

source: Folder creation
fr: Création d'un nouveau dossier

source: Folder name
fr: Nom du dossier

# ForeColor
source: Foreground color
fr: Couleur de texte

# GenerateObjectComment
source: Create or replace a generation of a sculpture
fr: Crée ou remplace la génération de la sculpture

# GenerateSculptureComment
source: From a sculpture, it creates objects; you can choice to obtain a page, a master page, a master object or just a tool (all HTML content result will be written in it)
fr: A partir de la sculpture, le programme génère automatiquement un ou plusieurs objets intégrés dans le projet. La sculpture peut être convertie en une page complète avec une master page, ou bien un master objet ou bien encore un outil (tout le code HTML généré y sera écrit).

# ImportFile
source: Import a file
fr: Importer un fichier

# InsertObject
source: Insert an object
fr: Insérer un objet

# IsClean
source: Clean
fr: Pas de modification

# LabelAddObjectMasterObjectSelect
source: Select a master object
fr: Sélection d'un modèle d'objet

# LabelAddObjectName
source: Object name to create
fr: Nom de l'objet à créer

# LabelAddObjectToolSelect
source: Select a tool
fr: Sélection d'un outil

source: Margin
fr: Marge

# MenuAbout
source: About
fr: A propos de

# MenuClose
source: Close
fr: Fermer

# MenuCreate
source: Create
fr: Créer

# MenuExpand
source: Expand
fr: Déplier

# MenuGenerate
source: Generate web
fr: Générer le site

# MenuImportFile
source: A file
fr: Un fichier

# MenuImportMasterObjects
source: Master objects
fr: Modèles d'objet

# MenuImportMasterPages
source: Master pages
fr: Modèles de page

# MenuImportTools
source: Tools
fr: Outils

# MenuOpen
source: Open
fr: Ouvrir

# MenuQuit
source: Quit
fr: Quitter

# MenuRename
source: Rename
fr: Renommer

# MenuSuppress
source: Suppress
fr: Supprimer

source: Name
fr: Nom

# OpenColorDialog
source: Open the color dialog
fr: Ouvrir la fenêtre des couleurs

source: Padding
fr: Espacement

source: Path
fr: Chemin

# PendingModification
source: You have made change
fr: Modification en cours

# RectangleFormat
source: left,right,top,bottom
fr: gauche,droite,haut,bas

# RootMenuFolder
source: Folders
fr: Dossiers

# RootMenuHelp
source: Help
fr: Aide

# RootMenuImport
source: Import
fr: Importer

# RootMenuMasterObjects
source: Master objects
fr: Modèles d'objets

# RootMenuMasterPages
source: Master pages
fr: Modèles de pages

# RootMenuProject
source: Projects
fr: Projets

# RootMenuSculpting
source: Sculpt
fr: Sculpter

# RootMenuTools
source: Tools
fr: Outils

source: Save
fr: Enregistrer

# SelectColor
source: Select a color
fr: Sélectionner une couleur

# SoftwareTitle
source: Easy Html For Developers
fr: Modeleur Html pour programmeurs

# UnselectComment
source: Type space bar to unselect Format #(tag)
fr: Touche espace pour déselectionner Format #(etiquette)

# URLImage
source: Image on background (url)
fr: Image de fond (url)

source: Value
fr: Valeur

# ConversionType
source: Create a master page Create a new page Create a master objet Create a tool
fr: Créer un modèle de page Créer une nouvelle page Créer un modèle d'objet Créer un outil

# GenerateScultpture
source: Sculpture generation
fr: Génération d'une sculpture

source: Html options
fr: Options html

# ImageImport
source: Import image
fr: Importer une image

source: Import
fr: Importer

# InsertHtmlAfter
source: HTML content ending
fr: Code HTML à insérer après

# InsertHtmlBefore
source: HTML content starter
fr: Code HTML à insérer avant

source: Javascript options
fr: Options javascript

source: Areas
fr: Zones

# ButtonAdvanced
source: Advanced
fr: Avançé

# ButtonCreateNewMasterObject
source: Create a new master object
fr: Créer un nouveau modèle d'objet

# CodeCSS
source: CSS programming
fr: Programmation CSS

# CodeJavascript
source: Javascript programming
fr: Programmation javascript

# CodeJavascriptOnLoad
source: Executes this code on load
fr: Code à exécuter à l'ouverture de la page

# ColumnCount
source: # of columns
fr: Nombre de colonnes

# ConfigJavascript
source: Javascript links
fr: Liens javascript

# FixedConstraints
source: fixed
fr: fixe

source: Height
fr: Hauteur

# LineCount
source: # of lines
fr: Nombre de lignes

# MasterObjectAdvancedProperties
source: Advanced properties of a master object -
fr: Propriétés avançées du modèle d'objet -

# MasterObjectAdvancedPropertiesComment
source: Encapsulate HTML hierarchy around this master object
fr: Enrouler ce modèle d'objet avec du code HTML

# MasterObjectCreation
source: Create a new master object
fr: Créer un nouveau modèle d'objet

# MasterObjectCreationComment
source: Inserts a master object into a single page or into a master page. In order to compose successives areas, select multiple cells on the static grid
fr: Un modèle d'objet s'intègre par sélection de celui-ci sur une page ou sur un modèle de page. Pour former des zones contigües, sélectionner plusieurs cases sur le quadrillage défini.

# MasterObjectCreationForm
source: Create all adjacents zones
fr: Remplir tout le quadrillage

# MasterObjectForm
source: Edit master object - {0}
fr: Modèle d'objet - {0}

source: Master object properties
fr: Propriétés du modèle d'objet

# RelativeConstraints
source: relative
fr: relatif

source: Title
fr: Titre

# TitleComment
source: This title is not viewed on the final web site
fr: Le titre sera uniquement affiché dans l'arborescence du projet

source: Width
fr: Longueur

# BodyCodeCSS
source: CSS master page properties
fr: Code CSS du modèle de page

# ButtonRename
source: Rename
fr: Renommer

source: Change type
fr: Changer type

source: Container
fr: Conteneur

source: Delete
fr: Supprimer

# GenerateFromSculpture
source: Automatically generate objects
fr: Génération automatique des objets

# HeaderDynamic
source: Dynamic
fr: Dynamique

# HeaderMasterObject
source: Master object
fr: Modèle d'objet

# HeaderPicture
source: Picture
fr: Image

# HeaderText
source: Text
fr: Texte

# HeaderTool
source: Tool
fr: Outil

# MasterObjectReference
source: Master object ref.
fr: Ref. modèle d'objet

# MasterPageCreationComment
source: One or more pages can have the same master page. In order to compose successives areas, select multiple cells on the static grid
fr: Une ou plusieurs pages peuvent avoir le même modèle de page. Pour former des zones contigües, sélectionner plusieurs cases sur le quadrillage défini.

# MasterPageCreationForm
source: Create all adjacents zones
fr: Remplir tout le quadrillage

# MasterPageForm
source: Edit master page - {0}
fr: Modèle de page - {0}

source: Master page options
fr: Options d'un modèle de page

source: Master page properties
fr: Propriétés du modèle de page

# MasterPageSelectionComment
source: Available master pages
fr: Les modèles de page disponibles

# NewGenerationComment
source: Obtain the first version of the selected sculpture with a name, a title or else a path
fr: Générez la première version de la sculpture en indiquant un nom, un titre ou un chemin

source: New object
fr: Nouvel objet

# NewToolCreation
source: Create a new tool
fr: Créer un nouvel outil

source: Object
fr: Objet

# ObjectForm
source: Object
fr: Objet

source: Object name
fr: Nom de l'objet

source: Object type
fr: Type d'objet

source: Object type creation
fr: Créer le type de l'objet

# ObjectTypeList
source: picture text tool master object dynamic object
fr: image texte outil modèle d'objet objet dynamique

# PageCreationForm
source: Page creation
fr: Création d'une page

# PageNameComment
source: Folders are separated by a / char
fr: Les dossiers sont séparés par un /

# PageProperties
source: Properties of a page
fr: Propriétés de la page

# RadioErasePrevious
source: Erase the previous version
fr: Ecraser la version en cours

# RadioNewVersion
source: Create a newer version
fr: Créer une nouvelle version

# RadioWriteCSS
source: Write CSS into a file
fr: Ecrire le CSS dans un fichier

# RadioWriteJavascript
source: Write Javascript source into a file
fr: Ecrire le code javascript dans un fichier

source: Rename project
fr: Renommer le nom du projet

source: Scale
fr: Echelle

# SchemeColorComment
source: Paste a CSS source code with a chart of colors
fr: Coller un contenu CSS pour créer un schéma de couleurs

# SculptureCreationComment
source: A sculpture is a set of objects organized as a full rectangular set. Each object takes a rectangular piece of the owner.
fr: La création d'une sculpture permet de créer une nouvelle page avec une master page et un ou plusieurs master objets contenant éventuellement des outils tels qu'une image ou du texte. Les tailles de chaque partie de la page sont fixées par la sculpture définie ici.

# SculptureCreationForm
source: Sculpture creation
fr: Création d'une sculpture

# SculptureGenerationComment
source: Previous computed results have ever been registered. Do you want to erase it or create a new one ?
fr: Une ou des générations précédentes ont été enregistrées. Souhaitez-vous écraser une version précédente ou en créer une nouvelle ?

# WriteCSSFile
source: CSS filename
fr: Nom du fichier CSS

# WriteJavascriptFile
source: Javascript filename
fr: Nom du fichier javascript

source: X border
fr: Bord X

# XCoordinate
source: X pos.
fr: Position X

# XPadding
source: X pad.
fr: Espacement X

source: Y border
fr: Bord Y

# YCoordinate
source: Y pos.
fr: Position Y

# YPadding
source: Y pad.
fr: Espacement Y

# ButtonSiteGeneration
source: Generate the entire web site
fr: Générer le site

# GenerateComment
source: Full path of the destination folder
fr: Chemin d'accès sur le disque dur à la racine du site web

# GenerateProduction
source: Make the entire web site
fr: Génération complète du site web

# ObjectProperties
source: Object - {0}
fr: Objet - {0}

# ToolForm
source: Tool - {0}
fr: Outil - {0}

source: Tool properties
fr: Propriétés de l'outil

source: Languages
fr: Langues

# CodeCSSMasterPage
source: CSS programming on the body element
fr: Code CSS de l'élément body

# ForcedConstraints
source: strict
fr: forcé

# Advanced
source: Advance
fr: Advanced

source: Folder
fr: Dossier

source: Root page
fr: Page racine

source: Tool instance
fr: Instance d'outil

source: Master object
fr: Modèle d'objet

# MasterObjectCreationWindow
source: Create master object - {0}
fr: Créer le modèle d'objet - {0}

source: Master page
fr: Modèle de page

# MasterPageCreationWindow
source: Create master page - {0}
fr: Créer le modèle de page - {0}

source: Tool
fr: Outil

# MenuImportFolders
source: Folders
fr: Dossiers

source: ERROR ON SAVE
fr: ERREUR SAUVEGARDE

# ButtonTerminate
source: Terminate
fr: Terminer

# ConversionTypeLabel
source: Conversion switch
fr: Sélection de la conversion

source: Fix rendering errors
fr: Corrige les tailles

# ScaleValue
source: 16:1 (16 times bigger) 8:1 (8 times bigger) 4:1 (4 times bigger) 2:1 (2 times bigger) 1:1 (Identity) 1:2 (2 times smaller) 1:4 (4 times smaller) 1:8 (8 times smaller) 1:16 (16 times smaller)
fr: 16:1 (16 fois plus grand) 8:1 (8 fois plus grand) 4:1 (4 fois plus grand) 2:1 (2 fois plus grand) 1:1 (Identité) 1:2 (2 fois plus petit) 1:4 (4 fois plus petit) 1:8 (8 fois plus petit) 1:16 (16 fois plus petit

# CarefullWindowsOpenText
source: Another window is open. Continue ?
fr: Une autre fenêtre est ouverte. Continuer ?

# CarefullWindowsOpenTitle
source: Carefull
fr: Attention

source: Dynamic
fr: Dynamique

# ExceptionHexadecimalOverflow
source: Arithmetic overflow (hexadecimal)
fr: Dépassement de capacité (hexadécimal)

# ExceptionIncompletPath
source: Incomplete path
fr: Le chemin fourni est incomplet

# ExceptionMalFormedContent
source: Incorrect CSS content. Format name:value;...
fr: Contenu CSS incorrect. Format nom:valeur;...

# ExceptionMasterObjectNotExists
source: Instance '{1}' does not know '{0}'
fr: L'instance '{1}' ne provient pas du modèle d'objet '{0}'

# ExceptionMasterPageNotExists
source: Master page '{0}' of the page '{1}/{2}' does not exist
fr: Le modèle de page '{0}' pour la page '{1}/{2}' a disparu

# ExceptionNotHexadecimal
source: Incorrect hexadecimal format
fr: Format hexadécimal incorrect

# ExceptionNotHexadecimalChar
source: Non hexadecimal char
fr: Caractère non hexadécimal

# ExceptionPageNotCreated
source: The page has not created
fr: La page n'a pas été créée

# ExceptionPathNotExists
source: Path does not exist
fr: Le chemin fourni n'existe pas

# ExceptionProjectNotLoaded
source: Failed to load project
fr: Echec du chargement du projet

# ExceptionToolNotCreated
source: The tool has not created
fr: L'outil n'a pas été créé

# ExceptionToolNotExists
source: Tool does not exist
fr: L'outil fourni n'existe pas

# HorizontalAreaStringified
source: Horizontal area - {0} - {1}
fr: Zone horizontale - {0} - {1}

source: Master object
fr: Modèle d'objet

# OUTIL
source: Tool
fr: Outil

# TEXTE
source: Text
fr: Texte

# VerticalAreaStringified
source: Vertical area - {0} - {1}x{2}
fr: Zone verticale - {0} - {1}x{2}

# MenuTutorial
source: Interactive tutorial
fr: Didacticiel interactif

# ButtonPrevious
source: Previous
fr: Précédent

# ConversionTitle
source: Convert
fr: Convertir
